Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90144.atdf
        <module name="PM" id="03926" name2="pwr_rpmu_pm_v1" version="1a0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x44010000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1" caption="Backup domain is implemented"/>
              <param name="PD_NUM" value="0" caption="Number of switchable Power Domains"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for PM"/>
              <param name="MCLK_ID_APB" value="6" caption="Index for PM APB clock"/>
              <param name="PAC_ID" value="3" caption="Index for PM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="03720" name2="gpio_port_u2210_v4" version="4a0">
          <instance name="PORT">
            <register-group name="PORT_AHB" name-in-module="PORT" address-space="base" offset="0x40000000"/>
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x44840000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="58" function="default" pad="PB26"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="68" function="default" pad="PC04"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
              <signal group="P" index="87" function="default" pad="PC23"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
              <signal group="P" index="93" function="default" pad="PC29"/>
              <signal group="P" index="96" function="default" pad="PD00"/>
              <signal group="P" index="97" function="default" pad="PD01"/>
              <signal group="P" index="98" function="default" pad="PD02"/>
              <signal group="P" index="99" function="default" pad="PD03"/>
              <signal group="P" index="100" function="default" pad="PD04"/>
              <signal group="P" index="101" function="default" pad="PD05"/>
              <signal group="P" index="102" function="default" pad="PD06"/>
              <signal group="P" index="103" function="default" pad="PD07"/>
              <signal group="P" index="104" function="default" pad="PD08"/>
              <signal group="P" index="105" function="default" pad="PD09"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="109" function="default" pad="PD13"/>
              <signal group="P" index="110" function="default" pad="PD14"/>
              <signal group="P" index="111" function="default" pad="PD15"/>
              <signal group="P" index="112" function="default" pad="PD16"/>
              <signal group="P" index="113" function="default" pad="PD17"/>
              <signal group="P" index="114" function="default" pad="PD18"/>
              <signal group="P" index="115" function="default" pad="PD19"/>
              <signal group="P" index="116" function="default" pad="PD20"/>
              <signal group="P" index="117" function="default" pad="PD21"/>
            </signals>
            <parameters>
              <param name="AHB_IMPLEMENTED" value="1"/>
              <param name="BITS" value="204"/>
              <param name="DRVSTR" value="0" caption="Number of DRVSTR bits (0/1/2)"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="4"/>
              <param name="HADDR_MSB" value="25" caption="AHB bus address MSB"/>
              <param name="IOBUS_IMPLEMENTED" value="0"/>
              <param name="MSB" value="203"/>
              <param name="ODRAIN" value="1" caption="ODRAIN supported?"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="IOBUS2 implemented?"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="2" caption="Number of SLEWLIM bits (0/1/2)"/>
              <param name="INSTANCE_ID" value="18" caption="Instance index for PORT"/>
              <param name="MCLK_ID_AHB" value="22" caption="Index for PORT AHB clock"/>
              <param name="MCLK_ID_APB" value="23" caption="Index for PORT APB clock"/>
              <param name="PAC_ID" value="18" caption="Index for PORT registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PRM" id="03575" name2="prm_boot_ahb_v1" version="1a0">
          <instance name="PRM">
            <register-group name="PRM" name-in-module="PRM" address-space="base" offset="0x44080000"/>
            <parameters>
              <param name="PRMWS_DEFAULT" value="0" caption="Default value of PRMWS register field"/>
              <param name="ROM_KEN" value="0" caption="Value driven on to ROM's KEN input"/>
              <param name="ROM_SPLIT" value="0x0e00" caption="Address defining first restricted address"/>
              <param name="INSTANCE_ID" value="21" caption="Instance index for PRM"/>
              <param name="MCLK_ID_AHB" value="28" caption="Index for PRM AHB clock"/>
              <param name="MCLK_ID_APB" value="29" caption="Index for PRM APB clock"/>
              <param name="PAC_ID" value="21" caption="Index for PRM registers write protection"/>
            </parameters>
          </instance>
        </module>
