Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90144.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x45014000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PD10" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PD11" ioset="1"/>
              <signal group="WO" index="2" function="F" pad="PD12" ioset="1"/>
              <signal group="WO" index="3" function="F" pad="PA04" ioset="1"/>
              <signal group="WO" index="4" function="F" pad="PA03" ioset="1"/>
              <signal group="WO" index="5" function="F" pad="PA02" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="44" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="45" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="46" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="47" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="48" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="49" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="43" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="33" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="6" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="35" caption="Instance index for TCC2"/>
              <param name="MCLK_ID_APB" value="43" caption="Index for TCC2 APB clock"/>
              <param name="PAC_ID" value="35" caption="Index for TCC2 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC3">
            <register-group name="TCC3" name-in-module="TCC" address-space="base" offset="0x45810000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA05"/>
              <signal group="WO" index="1" function="F" pad="PA06"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="51" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="52" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="50" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="34" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="36" caption="Instance index for TCC3"/>
              <param name="MCLK_ID_APB" value="44" caption="Index for TCC3 APB clock"/>
              <param name="PAC_ID" value="36" caption="Index for TCC3 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC4">
            <register-group name="TCC4" name-in-module="TCC" address-space="base" offset="0x45812000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC12" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC29" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC13" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PD13" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="54" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="55" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="53" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="35" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="37" caption="Instance index for TCC4"/>
              <param name="MCLK_ID_APB" value="45" caption="Index for TCC4 APB clock"/>
              <param name="PAC_ID" value="37" caption="Index for TCC4 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC5">
            <register-group name="TCC5" name-in-module="TCC" address-space="base" offset="0x46010000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC08" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC23" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC09" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PC24" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="57" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="58" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="56" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="36" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="38" caption="Instance index for TCC5"/>
              <param name="MCLK_ID_APB" value="46" caption="Index for TCC5 APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for TCC5 registers write protection"/>
            </parameters>
          </instance>
