Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90144.atdf
        <register name="PLL0_POSTDIVA" offset="0xF8" rw="RW" size="4" access-size="4" caption="PLL0 POSTDIVA Settings (BROM_PLLEN must be set)">
          <bitfield name="POSTDIV" caption="PLL output 0 clock division factor" mask="0x3F"/>
          <bitfield name="OUTEN" caption="PLL output 0 enable" mask="0x80"/>
        </register>
        <register name="MCLK_CLKDIV1" offset="0xFC" rw="RW" size="4" access-size="4" caption="MCLK CLKDIV1 Settings (BROM_PLLEN must be set)">
        </register>
        <register name="GCLK_GENCTRL0" offset="0x100" rw="RW" size="4" access-size="4" caption="GCLK GENCTRL0 Settings (BROM_PLLEN must be set)">
        </register>
        <register name="BROM_BOOTCFGCRC" offset="0x110" rw="RW" size="4" access-size="4" count="4" caption="Boot Configuraiton Page CRC">
        </register>
        <register name="BROM_PAGEEND" offset="0x120" rw="RW" size="4" access-size="4" caption="Page End Marker for Verified Data">
        </register>
      </register-group>
      <register-group name="FUSES_CALOTP" caption="Defines FUSE parameters">
        <register name="FCCFG64" offset="0x180" rw="R" size="4" access-size="4" caption="PTC Calibration">
          <bitfield name="PTCFG0" caption="" mask="0xFFFF"/>
        </register>
        <register name="FCCFG65" offset="0x184" rw="R" size="4" access-size="4" caption="ADC Calibration">
          <bitfield name="ADCFG0" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="FCCFG66" offset="0x188" rw="R" size="4" access-size="4" caption="Comparator Calibration">
          <bitfield name="ACPAIR_SEL" caption="" mask="0xFF"/>
        </register>
        <register name="FCCFG72" offset="0x1A0" rw="R" size="4" access-size="4" caption="MAC ID (31 through 0)">
          <bitfield name="FMAC_31_0" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="FCCFG73" offset="0x1A4" rw="R" size="4" access-size="4" caption="MAC ID (47 through 32)">
          <bitfield name="FMAC_47_32" caption="" mask="0xFFFF"/>
        </register>
        <register name="FCCFG_UNIQID" offset="0x1E0" rw="R" size="4" access-size="4" count="4" caption="Factory programed Unique ID">
          <bitfield name="UID" caption="Unique ID (programmed at factory)" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="FUSES_DALCFG" caption="Defines FUSE parameters">
        <register name="DAL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Access Level">
          <bitfield name="CPU0" caption="Host DAL Elevation Value" mask="0xFF" values="DAL__CPU0"/>
          <bitfield name="CPU1" caption="HSM DAL Elevation Value" mask="0xFF00" values="DAL__CPU1"/>
        </register>
      </register-group>
      <register-group name="FUSES_USERCFG1" caption="Defines FUSE parameters">
        <register name="FSEQ" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Sequence Number">
          <bitfield name="SEQNUM" caption="Sequence Number" mask="0xFFFF"/>
          <bitfield name="SEQBAR" caption="Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="AFSEQ" offset="0x20" rw="RW" size="4" access-size="4" caption="Flash Alternate Sequence Number">
          <bitfield name="ASEQNUM" caption="Alternate Sequence Number" mask="0xFFFF"/>
          <bitfield name="ASEQBAR" caption="Alternate Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="FUCFG0" offset="0x40" rw="RW" size="4" access-size="4" caption="WDT Configuration">
          <bitfield name="WDT_ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WDT_WEN" caption="Window Mode Enable" mask="0x4"/>
          <bitfield name="WDT_RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="WDT_ALWAYSON" caption="Always On" mask="0x80"/>
          <bitfield name="WDT_PER" caption="Time-out Period" mask="0xF00"/>
          <bitfield name="WDT_WINDOW" caption="Window Mode Time-out Period" mask="0xF000"/>
          <bitfield name="WDT_EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF0000"/>
        </register>
        <register name="FUCFG1" offset="0x44" rw="RW" size="4" access-size="4" caption="User Configuration 1 (System Bus Configuration)">
          <bitfield name="SSXEXDRM" caption="Execute from System Memory" mask="0xFF"/>
          <bitfield name="SSXEXEBI" caption="Execute from EBI attached Memory" mask="0xFF00"/>
          <bitfield name="SSXEXSQI0" caption="Execute from SQI0 XIP Memory" mask="0xFF0000"/>
          <bitfield name="SSXEXSQI1" caption="Execute from SQI1 XIP Memory" mask="0xFF000000"/>
        </register>
        <register name="FUCFG2" offset="0x48" rw="RW" size="4" access-size="4" caption="User Configuration 2 (Deep Sleep SMOR Configuration)">
          <bitfield name="BOR_HYST" caption="BOT Trip Hystersis" mask="0x1"/>
          <bitfield name="BOR_TRIP" caption="BOT Trip Points" mask="0x6"/>
        </register>
        <register name="FUCFG3" offset="0x4C" rw="RW" size="4" access-size="4" caption="User Configuration 2 (SMOR Configuration)">
          <bitfield name="HYST_BOR_VDDIO" caption="BOR Trip Point Hystersis for VDDIO" mask="0x1"/>
          <bitfield name="BOR_TRIP_VDDIO" caption="BOR Trip Points for VDDIO" mask="0x6"/>
          <bitfield name="HYST_BOR_VDDA" caption="BOR Trip Point Hystersis for VDDANA" mask="0x40"/>
          <bitfield name="BOR_TRIP_VDDA" caption="BOR Trip Points for VDDANA" mask="0x180"/>
          <bitfield name="HYST_BOR_VDDREG" caption="BOR Trip Point Hystersis for VDDREG" mask="0x400"/>
        </register>
        <register name="FUCFG5" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="User Configuration 5 (VREG Charge Pump Configuration)">
          <bitfield name="UCP0" caption="Charge Pump Settings" mask="0xF"/>
          <bitfield name="UCP1" caption="Charge Pump Settings" mask="0xF0"/>
          <bitfield name="UCP2" caption="Charge Pump Settings" mask="0xF00"/>
          <bitfield name="UCP3" caption="Charge Pump Settings" mask="0xF000"/>
        </register>
        <register name="FUCFG6" offset="0x58" rw="RW" size="4" access-size="4" caption="User Configuration 6 (FCR ECCCTRL Configuration)">
          <bitfield name="PFM_ECCCTL" caption="ECC Mode Control" mask="0x30"/>
          <bitfield name="PFM_ECCUNLCK" caption="ECC Mode Control Unlock" mask="0x40"/>
        </register>
        <register name="FUCFG7" offset="0x5C" rw="RW" size="4" access-size="4" caption="User Configuration 7 (FCR CTRLB Configuration)">
          <bitfield name="PFM_TEMP" caption="NVM Operating Temperature Read Mode" mask="0x2"/>
        </register>
        <register name="FUCFG8" offset="0x60" rw="RW" size="4" access-size="4" caption="User Configuration 8 (FCW CWP Configuration)">
          <bitfield name="PFM_UC1WP" caption="User Configuration Page 1 Write Protect" mask="0x1"/>
          <bitfield name="PFM_UC2WP" caption="User Configuration Page 2 Write Protect" mask="0x100"/>
          <bitfield name="PFM_UC1WPLOCK" caption="User Configuration Page 1 Write Protection Lock" mask="0x10000"/>
          <bitfield name="PFM_UC2WPLOCK" caption="User Configuration Page 2 Write Protection Lock" mask="0x1000000"/>
        </register>
        <register name="FUCFG9" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000202" caption="User Configuration 9 (RAM BISR and ECC Configuraiton)">
          <bitfield name="RAM_INIT_ENB" caption="Enable RAM ECC Init at Reset" mask="0x2"/>
          <bitfield name="BISR_RST_EN0" caption="Enable RAM Built-In Self Repair at Reset" mask="0x200"/>
        </register>
        <register name="FUCFG16" offset="0x80" rw="RW" size="4" access-size="4" caption="User Configuration 16 (HSM Firmware Metadata 0 Address)">
          <bitfield name="HSM_PTRMETA0" caption="HSM Firmware Metadata pointer 0" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUCFG24" offset="0xA0" rw="RW" size="4" access-size="4" caption="User Configuration 24 (HSM Firmware Metadata 1 Address)">
          <bitfield name="HSM_PTRMETA1" caption="HSM Firmware Metadata pointer 1" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="BLDRCFG__BROM_EN_BFMCHK">
        <value name="NONE" caption="No verification" value="0x0"/>
        <value name="CRC32" caption="Verify using crc32" value="0x1"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__VREGOUT">
        <value name="1p2v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v." value="0x0"/>
        <value name="1p0v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v." value="0x1"/>
        <value name="0p8v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v." value="0x2"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__OFFSTDBY">
        <value name="OFF" caption="In standby mode, VREGSW1,2,3 are OFF" value="0x0"/>
        <value name="ON" caption="In standby mode, VREGSW1,2,3 are ON" value="0x1"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__LVSTDBY">
        <value name="1p2v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v." value="0x0"/>
        <value name="0p8v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v." value="0x1"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__LVHIB">
        <value name="1p2v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v." value="0x0"/>
        <value name="0p8v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v" value="0x1"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__ULDOSTDBY">
        <value name="OFFINSTDBY" caption="Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well." value="0x0"/>
        <value name="ONINSTDBY" caption="Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well." value="0x1"/>
      </value-group>
      <value-group name="RPMU_VREGCTRL__ULDOLEVEL">
        <value name="1p2v" caption="Vout = 1.2v" value="0x0"/>
        <value name="1p5v" caption="Vout = 1.5v" value="0x1"/>
        <value name="1p8v" caption="Vout = 1.8v" value="0x2"/>
        <value name="2p5v" caption="Vout = 2.5v" value="0x3"/>
      </value-group>
